In [4]:
import pandas as pd

In [6]:
data = pd.read_csv("data1.csv")
data.head()

,CustomerID,CustomerName,Age,Gender,City,Product,Price,PurchaseDate,PaymentMethod,SubscriptionType,UsageHours,FeedbackScore,IsReturningCustomer,DiscountReceived,ReferralSource
0,8270,Customer_0,26,Male,Los Angeles,Headphones,914.38,2023-11-20,Cash,Monthly,9.27,4,True,27.66,Advertisement
1,1860,Customer_1,27,Female,New York,Smartwatch,143.27,2023-10-15,Crypto,NaN,2.89,2,False,26.02,Friend
2,6390,Customer_2,75,Female,Phoenix,Laptop,124.14,2023-12-02,Debit Card,Annual,17.41,4,True,49.73,Friend
3,6191,Customer_3,61,Female,Los Angeles,Laptop,1505.10,2022-02-18,Crypto,Monthly,89.19,4,False,10.09,Friend
4,6734,Customer_4,34,Non-binary,Los Angeles,Headphones,1335.12,2022-10-29,Debit Card,Annual,24.91,3,True,12.91,Advertisement

In [23]:
data.isna().sum()

CustomerID               0
CustomerName             0
Age                      0
Gender                   0
City                     0
Product                  0
Price                    0
PurchaseDate             0
PaymentMethod            0
SubscriptionType       164
UsageHours               0
FeedbackScore            0
IsReturningCustomer      0
DiscountReceived         0
ReferralSource         130
dtype: int64

In [31]:
data.dtypes

CustomerID               int64
CustomerName            object
Age                      int64
Gender                  object
City                    object
Product                 object
Price                  float64
PurchaseDate            object
PaymentMethod           object
SubscriptionType        object
UsageHours             float64
FeedbackScore            int64
IsReturningCustomer       bool
DiscountReceived       float64
ReferralSource          object
dtype: object

In [37]:
data.fillna("Bilinmiyor",inplace=True)

In [39]:
data.isna().sum()

CustomerID             0
CustomerName           0
Age                    0
Gender                 0
City                   0
Product                0
Price                  0
PurchaseDate           0
PaymentMethod          0
SubscriptionType       0
UsageHours             0
FeedbackScore          0
IsReturningCustomer    0
DiscountReceived       0
ReferralSource         0
dtype: int64

In [151]:
genc = data[data["Age"]<27]

In [153]:
orta = data[(data["Age"] >= 27) & (data["Age"] <=65)]

In [155]:
yasli = data[data["Age"]>65]

In [157]:
len(yasli)

122

In [159]:
len(genc)

76

In [161]:
len(orta)

302

In [163]:
len(data)

500

In [183]:
toplam_satis = data.groupby("City",as_index=False)["Price"].sum()

In [185]:
toplam_satis

          City      Price
0      Chicago  102574.24
1      Houston   90865.00
2  Los Angeles  102716.05
3     New York   98336.30
4      Phoenix  107750.99

In [187]:
toplam_satis.max()

City       Phoenix
Price    107750.99
dtype: object

In [191]:
toplam_satis.min()

City     Chicago
Price    90865.0
dtype: object

In [277]:
data["Product"].value_counts()

Product
Smartwatch    110
Headphones    108
Phone         108
Laptop         97
Tablet         77
Name: count, dtype: int64

In [289]:
data.groupby("City",as_index=True)["Product"].value_counts()

City         Product
Chicago      Headphones    24
             Smartwatch    24
             Phone         21
             Laptop        14
             Tablet        13
Houston      Smartwatch    28
             Headphones    19
             Phone         19
             Laptop        18
             Tablet        16
Los Angeles  Smartwatch    25
             Headphones    24
             Laptop        24
             Phone         18
             Tablet        13
New York     Phone         27
             Laptop        20
             Headphones    18
             Tablet        16
             Smartwatch    15
Phoenix      Headphones    23
             Phone         23
             Laptop        21
             Tablet        19
             Smartwatch    18
Name: count, dtype: int64

In [271]:
data.groupby("Product",as_index=False)["Price"].sum()

      Product      Price
0  Headphones  106558.03
1      Laptop  103217.74
2       Phone  101944.14
3  Smartwatch  111802.62
4      Tablet   78720.05

In [293]:
urunsatisi = data.groupby("Product",as_index=False)["Price"].sum()
urunsatisi

      Product      Price
0  Headphones  106558.03
1      Laptop  103217.74
2       Phone  101944.14
3  Smartwatch  111802.62
4      Tablet   78720.05

In [297]:
urunsayisi =data["Product"].value_counts()
urunsayisi

Product
Smartwatch    110
Headphones    108
Phone         108
Laptop         97
Tablet         77
Name: count, dtype: int64

In [307]:
urunsatisi["AveragePrice"] = urunsatisi.apply(lambda row: row["Price"] / urunsayisi[row["Product"]], axis=1)
urunsatisi

      Product      Price  AveragePrice
0  Headphones  106558.03    986.648426
1      Laptop  103217.74   1064.100412
2       Phone  101944.14    943.927222
3  Smartwatch  111802.62   1016.387455
4      Tablet   78720.05   1022.338312